apps/rails3/beer_tweets/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0" dumptraffic="false">
  <!-- Client side setup -->
  <clients>
    <client host="localhost" cpu="2" />
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="server" port="8080" type="tcp"></server>
  </servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
       agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="server" type="erlang"></monitor>
  </monitoring>

  <load>
    <!-- several arrival phases can be set: for each phase, you can set
         the mean inter-arrival time between new clients and the phase
         duration -->

    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="1" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="6" duration="2" unit="minute">
      <users arrivalrate="50" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="2" unit="minute">
      <users arrivalrate="100" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="8" duration="2" unit="minute">
      <users arrivalrate="150" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="9" duration="2" unit="minute">
      <users arrivalrate="200" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="10" duration="2" unit="minute">
      <users arrivalrate="250" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="11" duration="5" unit="minute">
      <users arrivalrate="300" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="12" duration="5" unit="minute">
      <users arrivalrate="350" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="13" duration="5" unit="minute">
      <users arrivalrate="400" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="14" duration="5" unit="minute">
      <users arrivalrate="450" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="15" duration="5" unit="minute">
      <users arrivalrate="500" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="16" duration="5" unit="minute">
      <users arrivalrate="600" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="17" duration="5" unit="minute">
      <users arrivalrate="700" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="18" duration="5" unit="minute">
      <users arrivalrate="800" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>

    <session name="kind_like" probability="33" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"></http>
      </request>

      <thinktime random='true' value='2'/>

      <request>
        <http url="/kind/like" version="1.1" method="GET"></http>
      </request>
    </session>

    <session name="kind_cold" probability="33" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"></http>
      </request>

      <thinktime random='true' value='2'/>

      <request>
        <http url="/kind/cold" version="1.1" method="GET"></http>
      </request>
    </session>

    <session name="kind_drink" probability="34" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"></http>
      </request>

      <thinktime random='true' value='2'/>

      <request>
        <http url="/kind/drink" version="1.1" method="GET"></http>
      </request>
    </session>

  </sessions>
</tsung>